# ***Selecting a pandas Series from a DataFrame***

There two basic object types in pandas, that hold data,
- **DataFrame**
  - Table of rows and columns
- **Series**
  - Each of the column in DataFrame is known as Series

**Important to note** is, You can have a pandas Series that's not part of a DataFrame. but mostly we encounter series that are parts of dataframes.

- So here we'll see how to select a pandas series from a dataframe on which we may want to work on and do some analysis on.

In [2]:
# importing module
import pandas as pd

In [7]:
# data =reports of UFO sightings fro 1930 to 2020
ufo = pd.read_csv('http://bit.ly/uforeports')
print(type(ufo)) # prints type of ufo variable i.e. data

<class 'pandas.core.frame.DataFrame'>

In [8]:
ufo.head() # prints first 5 rows of the data

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [17]:
# basic way bracket notation # case sensitive
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [18]:
type(ufo['City'])

pandas.core.series.Series

In [15]:
# another method dot notation
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [16]:
type(ufo.City)

pandas.core.series.Series

In [19]:
# if column name has spaces in it then do notation will not work

ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

- dot notation will not work if we have a column name as a builtin method or attribute i.e. head, shape etc.

In [24]:
# create a new series in a pandas DataFrame
# use bracket notation to assign a new series.
ufo['Location'] = ufo.City +', '+ ufo.State # concatenates two columns
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"